<script lang="ts" setup>
// const props = defineProps({

// })
</script>

<template>
  <div class="app-footer">
    <div class="footer-nav">
      <div>
        <div class="nav-head">
          体育
        </div>
        <div>主页</div>
        <div>滚球</div>
        <div>体育博彩规则</div>
      </div>
      <div>
        <div class="nav-head">
          娱乐城
        </div>
        <div>游戏</div>
        <div>VIP俱乐部</div>
        <div>促销活动</div>
      </div>
      <div>
        <div class="nav-head">
          支持
        </div>
        <div>公平性</div>
        <div>联盟计划</div>
        <div>负责任博彩</div>
        <div>Gameble Aware</div>
        <div>在线支持</div>
        <div>帮助中心</div>
      </div>
      <div>
        <div class="nav-head">
          社区
        </div>
        <div>博客</div>
        <div>论坛</div>
        <div>Facebook</div>
        <div>Twitter</div>
        <div>Instagram</div>
        <div>Youtube</div>
        <div>网购</div>
      </div>
      <div>
        <div class="nav-head">
          关于我们
        </div>
        <div>隐私政策</div>
        <div>许可证</div>
        <div>反洗钱规则</div>
        <div>服务条款</div>
        <div>自我排除</div>
        <div>Primedice</div>
      </div>
      <div>
        <div class="nav-head">
          语言
        </div>
        <div>中文</div>
        <div>赔率</div>
        <div>小数式</div>
      </div>
    </div>
    <BaseDivider title-placement="center" />
    <div class="footer-support">
      <BaseAspectRatio v-for="i in 10" :key="i" ratio="116/35" width="133.33px" style="margin: 0 auto;">
        <svg xmlns="http://www.w3.org/2000/svg" style="color: #557086;" viewBox="0 0 1000 300">
          <path style="fill:#557086;" d="M185.53,60.3A89.7,89.7,0,1,1,95.84,150a89.7,89.7,0,0,1,89.69-89.7M171.31,94.83l-13.95,52.72-9.61,3.72-4.62,17.3,9.61-3.63-8,30.16h85.8l5.89-22.38H184.8l5.89-21.93,9.42-3.54,4.62-17.3-9.43,3.63L205.54,94.8H171.31Z" />
          <g style="fill:#557086;isolation:isolate;">
            <path d="M314.13,204.77,337.6,92.71h23L341.11,186h57l-3.9,18.73Z" />
            <path d="M426,123.59H447.9l-17,81.18H409Zm6.42-30.88h21.94l-4.13,19.87H428.25Z" />
            <path d="M458,139.87l3.36-16.28h10.7l2.68-13,25.15-15.13L494,123.59h13.38L504,139.87H490.55l-7.11,34q-1.9,9.26-1.91,10.55a5,5,0,0,0,1.61,3.94c1.07.94,3,1.41,5.81,1.41,1,0,3.39-.17,7.26-.53l-3.44,16.28a58.71,58.71,0,0,1-11.62,1.15q-11.62,0-16.89-4.48T459,189.78q0-3.74,2.83-17.27l6.8-32.64Z" />
            <path d="M583.65,171h-55c0,.87-.08,1.53-.08,2q0,8.1,4.63,13.07a14.82,14.82,0,0,0,11.27,5q10.93,0,17-11.32L581.13,183q-5.73,11.85-15.32,17.77a40.14,40.14,0,0,1-21.52,5.93q-16.37,0-26.6-10.36t-10.24-27.4a49.9,49.9,0,0,1,9.24-29.66q12.62-17.58,36-17.58,14.89,0,23.69,9.21t8.79,25.8A61.09,61.09,0,0,1,583.65,171ZM565.16,157.6c.05-1,.07-1.7.07-2.21q0-9-4.05-13.53a13.86,13.86,0,0,0-10.85-4.51,17.24,17.24,0,0,0-12.2,5.12q-5.39,5.11-7.29,15.13Z" />
            <path d="M646.72,174.19,668,177.63q-5.26,14.22-15.59,21.63a40,40,0,0,1-23.93,7.42q-15.51,0-24.61-9.25T594.81,172a58.3,58.3,0,0,1,5.51-25,42.21,42.21,0,0,1,16.59-18.54,45.74,45.74,0,0,1,24.3-6.76q14.37,0,22.93,7.49t9.64,19.72l-20.87,2.22q-.76-6.81-4.17-10a12.43,12.43,0,0,0-8.9-3.21A17.85,17.85,0,0,0,628,142.62q-5.5,4.74-8.45,14.18a59.65,59.65,0,0,0-2.94,17.7q0,7.19,3.52,11.08a11.33,11.33,0,0,0,8.79,3.9,16.36,16.36,0,0,0,10.16-3.82Q644,181.84,646.72,174.19Z" />
            <path d="M682,171.06q0-22.56,12.72-36t33.44-13.41q18,0,28.06,9.89t10.09,26.64a50,50,0,0,1-12.61,34.1Q741,206.68,719.87,206.68a43.56,43.56,0,0,1-20.33-4.59,30,30,0,0,1-13.23-13A38.71,38.71,0,0,1,682,171.06Zm62.52-15.67q0-7.8-4.55-12.5a15.57,15.57,0,0,0-11.73-4.7,19.64,19.64,0,0,0-12.61,4.39Q710.08,147,707,155.35a45.15,45.15,0,0,0-3.06,15.4q0,8.72,4.74,13.84a15.56,15.56,0,0,0,11.92,5.12q9,0,15.14-7.72Q744.49,171.05,744.48,155.39Z" />
            <path d="M791.34,123.59h21.94l-17,81.18H774.37Zm6.42-30.88H819.7l-4.13,19.87H793.63Z" />
            <path d="M835.14,123.59h20.79l-2.14,10.54a57.27,57.27,0,0,1,14.56-9.59,36.18,36.18,0,0,1,14.26-2.86q10,0,15.78,5.73t5.77,15.21q0,4.27-2.52,16.21l-9.55,45.94H870.15l9.63-46.1q2.15-10.32,2.14-12.3a8.82,8.82,0,0,0-2.48-6.62,9.56,9.56,0,0,0-6.92-2.4q-4.82,0-10.7,4.05a28.12,28.12,0,0,0-9.25,10.7q-2.45,4.74-5.51,19.34l-6.95,33.33H818.17Z" />
          </g>
        </svg>
      </BaseAspectRatio>
    </div>
    <BaseDivider title-placement="center" />
    <div class="footer-sponsor">
      <BaseAspectRatio v-for="i in 4" :key="i" ratio="116/35" width="133.33px" style="margin: 0 auto;">
        <svg xmlns="http://www.w3.org/2000/svg" style="color: #557086;" viewBox="0 0 1000 300">
          <path style="fill:#557086;" d="M185.53,60.3A89.7,89.7,0,1,1,95.84,150a89.7,89.7,0,0,1,89.69-89.7M171.31,94.83l-13.95,52.72-9.61,3.72-4.62,17.3,9.61-3.63-8,30.16h85.8l5.89-22.38H184.8l5.89-21.93,9.42-3.54,4.62-17.3-9.43,3.63L205.54,94.8H171.31Z" />
          <g style="fill:#557086;isolation:isolate;">
            <path d="M314.13,204.77,337.6,92.71h23L341.11,186h57l-3.9,18.73Z" />
            <path d="M426,123.59H447.9l-17,81.18H409Zm6.42-30.88h21.94l-4.13,19.87H428.25Z" />
            <path d="M458,139.87l3.36-16.28h10.7l2.68-13,25.15-15.13L494,123.59h13.38L504,139.87H490.55l-7.11,34q-1.9,9.26-1.91,10.55a5,5,0,0,0,1.61,3.94c1.07.94,3,1.41,5.81,1.41,1,0,3.39-.17,7.26-.53l-3.44,16.28a58.71,58.71,0,0,1-11.62,1.15q-11.62,0-16.89-4.48T459,189.78q0-3.74,2.83-17.27l6.8-32.64Z" />
            <path d="M583.65,171h-55c0,.87-.08,1.53-.08,2q0,8.1,4.63,13.07a14.82,14.82,0,0,0,11.27,5q10.93,0,17-11.32L581.13,183q-5.73,11.85-15.32,17.77a40.14,40.14,0,0,1-21.52,5.93q-16.37,0-26.6-10.36t-10.24-27.4a49.9,49.9,0,0,1,9.24-29.66q12.62-17.58,36-17.58,14.89,0,23.69,9.21t8.79,25.8A61.09,61.09,0,0,1,583.65,171ZM565.16,157.6c.05-1,.07-1.7.07-2.21q0-9-4.05-13.53a13.86,13.86,0,0,0-10.85-4.51,17.24,17.24,0,0,0-12.2,5.12q-5.39,5.11-7.29,15.13Z" />
            <path d="M646.72,174.19,668,177.63q-5.26,14.22-15.59,21.63a40,40,0,0,1-23.93,7.42q-15.51,0-24.61-9.25T594.81,172a58.3,58.3,0,0,1,5.51-25,42.21,42.21,0,0,1,16.59-18.54,45.74,45.74,0,0,1,24.3-6.76q14.37,0,22.93,7.49t9.64,19.72l-20.87,2.22q-.76-6.81-4.17-10a12.43,12.43,0,0,0-8.9-3.21A17.85,17.85,0,0,0,628,142.62q-5.5,4.74-8.45,14.18a59.65,59.65,0,0,0-2.94,17.7q0,7.19,3.52,11.08a11.33,11.33,0,0,0,8.79,3.9,16.36,16.36,0,0,0,10.16-3.82Q644,181.84,646.72,174.19Z" />
            <path d="M682,171.06q0-22.56,12.72-36t33.44-13.41q18,0,28.06,9.89t10.09,26.64a50,50,0,0,1-12.61,34.1Q741,206.68,719.87,206.68a43.56,43.56,0,0,1-20.33-4.59,30,30,0,0,1-13.23-13A38.71,38.71,0,0,1,682,171.06Zm62.52-15.67q0-7.8-4.55-12.5a15.57,15.57,0,0,0-11.73-4.7,19.64,19.64,0,0,0-12.61,4.39Q710.08,147,707,155.35a45.15,45.15,0,0,0-3.06,15.4q0,8.72,4.74,13.84a15.56,15.56,0,0,0,11.92,5.12q9,0,15.14-7.72Q744.49,171.05,744.48,155.39Z" />
            <path d="M791.34,123.59h21.94l-17,81.18H774.37Zm6.42-30.88H819.7l-4.13,19.87H793.63Z" />
            <path d="M835.14,123.59h20.79l-2.14,10.54a57.27,57.27,0,0,1,14.56-9.59,36.18,36.18,0,0,1,14.26-2.86q10,0,15.78,5.73t5.77,15.21q0,4.27-2.52,16.21l-9.55,45.94H870.15l9.63-46.1q2.15-10.32,2.14-12.3a8.82,8.82,0,0,0-2.48-6.62,9.56,9.56,0,0,0-6.92-2.4q-4.82,0-10.7,4.05a28.12,28.12,0,0,0-9.25,10.7q-2.45,4.74-5.51,19.34l-6.95,33.33H818.17Z" />
          </g>
        </svg>
      </BaseAspectRatio>
    </div>
    <BaseDivider title-placement="center" />
    <div class="footer-copyright">
      <BaseAspectRatio ratio="2/1" width="67px">
        <BaseLogo mode="svg" svg-name="app-logo" />
      </BaseAspectRatio>
      <div>© 2023 Stake.com | 版权所有</div>
      <div>1 USDT = US$1.00</div>
    </div>
    <div class="footer-description">
      Stake 由 Medium Rare N.V. 所属和经营，注册编号： 145353，注册地址： Korporaalweg 10, Willemstad, Curaçao。请通过 support@stake.com 与我们联系。 支付代理公司是 Medium Rare Limited，地址于 7-9 Riga Feraiou, LIZANTIA COURT, Office 310, Agioi Omologites, 1087 Nicosia, Cyprus 以及注册号：HE 410775 Stake 由库拉索政府授权和监管，并根据颁发给 Antillephone 的 8048/JAZ 号许可证运营。 Stake 已通过所有合规性审查，并获得合法授权，可进行所有机会与投注游戏的游戏操作。
    </div>
    <div class="footer-description">
      支持 support@stake.com | 合作伙伴 partners@stake.com | 新闻媒体 press@stake.com
    </div>
  </div>
</template>

<style scoped>
.app-footer {
  /* background-color: #0F212E; */
  display: grid;
  grid-gap: 2rem;
  padding: 32px 0;
  .footer-nav{
    display: grid;
    grid-template-columns: repeat(auto-fit,minmax(14ch,1fr));
    grid-gap: 1rem;
    color:var(--tg-secondary-light);
    font-size: var(--tg-font-size-default);
    font-weight: var(--tg-font-weight-normal);

    .nav-head{
      font-size: var(--tg-font-size-base);
      font-weight: 500;
      color: var(--tg-text-white);
      margin-bottom: 10px;
    }
    .nav-head~div{
      padding: 4px 0;
      cursor: pointer;
      &:hover{
        color: var(--tg-text-white);
      }
    }
  }
  .footer-support{
    display: flex;
    flex-wrap: wrap;
    justify-content: center;
    align-items: center;
    gap:2rem;
  }
  .footer-sponsor{
    display: flex;
    gap:0.5rem;
    /* flex-wrap: wrap;
    justify-content: center;
    align-items: center;
    gap:2rem; */
  }
  .footer-copyright{
    display: grid;
    justify-content: center;
    justify-items: center;
    align-items: center;
    color:var(--tg-secondary-light);
    gap:0.5rem;
    font-size: var(--tg-font-size-default);
  }
  .footer-description{
    line-height: 1.5;
    text-align: center;
    color:var(--tg-secondary-light);
    font-size: var(--tg-font-size-xs);
  }
}
</style>
